# 176. Second Highest Salary

Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

In [10]:
import pandas as pd


data1 = [[1, 100], [2, 200], [3, 300]]
employee1 = pd.DataFrame(data1, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

data2 = [[1, 100]]
employee2 = pd.DataFrame(data2, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

### Pandas 1

In [11]:
import pandas as pd

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    high = employee.salary.max()
    without_highest = employee[employee.salary!=high][['salary']]
    if len(without_highest) == 0:
        return pd.DataFrame({'SecondHighestSalary':[None]})
    return without_highest.sort_values('salary',ascending=False).rename(columns={'salary':'SecondHighestSalary'}).head(1)

In [12]:
second_highest_salary(employee1)

   SecondHighestSalary
1                  200

In [13]:
second_highest_salary(employee2)

  SecondHighestSalary
0                None

### Pandas 2

In [14]:
import pandas as pd

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    unique_salaries = sorted(employee.salary.unique())
    if len(unique_salaries) < 2:
        return pd.DataFrame({'SecondHighestSalary':[None]})
    return pd.DataFrame({'SecondHighestSalary':[unique_salaries[1]]})

In [15]:
second_highest_salary(employee1)

   SecondHighestSalary
0                  200

In [16]:
second_highest_salary(employee2)

  SecondHighestSalary
0                None